{
    "@odata.type":  "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
    "id":  "03b60a5e-6f32-415d-bd77-021d76114584",
    "lastModifiedDateTime":  "2021-07-08T23:58:55.3265362Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-07-02T14:46:58.5893208Z",
    "description":  "This device restriction configuration policy is for devices used by specific users or groups who are uniquely high risk (for example, users who handle highly sensitive data where unauthorized disclosure causes considerable material loss to the organization).",
    "displayName":  "PROD-MEM-DR-L3-ANDROID-BYOD",
    "version":  2,
    "passwordBlockFaceUnlock":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockIrisUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  365,
    "passwordMinimumLength":  6,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordBlockCount":  5,
    "passwordSignInFailureCountBeforeFactoryReset":  5,
    "passwordRequiredType":  "numericComplex",
    "workProfileAllowAppInstallsFromUnknownSources":  false,
    "workProfileDataSharingType":  "allowPersonalToWork",
    "workProfileBlockNotificationsWhileDeviceLocked":  true,
    "workProfileBlockAddingAccounts":  true,
    "workProfileBluetoothEnableContactSharing":  false,
    "workProfileBlockScreenCapture":  true,
    "workProfileBlockCrossProfileCallerId":  false,
    "workProfileBlockCamera":  false,
    "workProfileBlockCrossProfileContactsSearch":  true,
    "workProfileBlockCrossProfileCopyPaste":  true,
    "workProfileDefaultAppPermissionPolicy":  "deviceDefault",
    "workProfilePasswordBlockFaceUnlock":  false,
    "workProfilePasswordBlockFingerprintUnlock":  false,
    "workProfilePasswordBlockIrisUnlock":  false,
    "workProfilePasswordBlockTrustAgents":  true,
    "workProfilePasswordExpirationDays":  365,
    "workProfilePasswordMinimumLength":  6,
    "workProfilePasswordMinNumericCharacters":  null,
    "workProfilePasswordMinNonLetterCharacters":  null,
    "workProfilePasswordMinLetterCharacters":  null,
    "workProfilePasswordMinLowerCaseCharacters":  null,
    "workProfilePasswordMinUpperCaseCharacters":  null,
    "workProfilePasswordMinSymbolCharacters":  null,
    "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout":  5,
    "workProfilePasswordPreviousPasswordBlockCount":  5,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  5,
    "workProfilePasswordRequiredType":  "numericComplex",
    "workProfileRequirePassword":  true,
    "securityRequireVerifyApps":  true,
    "vpnAlwaysOnPackageIdentifier":  null,
    "vpnEnableAlwaysOnLockdownMode":  false,
    "workProfileAllowWidgets":  false,
    "workProfileBlockPersonalAppInstallsFromUnknownSources":  true
}
