{
    "@odata.type":  "#microsoft.graph.iosGeneralDeviceConfiguration",
    "id":  "fa24113a-8c1f-4a81-b33f-ccbc82738acc",
    "lastModifiedDateTime":  "2021-07-08T23:59:23.3818852Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-07-02T14:48:35.5937883Z",
    "description":  "This device restriction configuration policy introduces data transfer controls for managed apps. This is the configuration that is applicable to most mobile users accessing work or school data using personally owned devices.",
    "displayName":  "PROD-MEM-DR-L2-IOS-BYOD",
    "version":  2,
    "accountBlockModification":  false,
    "activationLockAllowWhenSupervised":  false,
    "airDropBlocked":  false,
    "airDropForceUnmanagedDropTarget":  true,
    "airPlayForcePairingPasswordForOutgoingRequests":  false,
    "appleWatchBlockPairing":  false,
    "appleWatchForceWristDetection":  true,
    "appleNewsBlocked":  false,
    "appsVisibilityListType":  "none",
    "appStoreBlockAutomaticDownloads":  false,
    "appStoreBlocked":  false,
    "appStoreBlockInAppPurchases":  false,
    "appStoreBlockUIAppInstallation":  false,
    "appStoreRequirePassword":  false,
    "autoFillForceAuthentication":  false,
    "bluetoothBlockModification":  false,
    "cameraBlocked":  false,
    "cellularBlockDataRoaming":  false,
    "cellularBlockGlobalBackgroundFetchWhileRoaming":  false,
    "cellularBlockPerAppDataModification":  false,
    "cellularBlockPersonalHotspot":  false,
    "cellularBlockPlanModification":  false,
    "cellularBlockVoiceRoaming":  false,
    "certificatesBlockUntrustedTlsCertificates":  true,
    "classroomAppBlockRemoteScreenObservation":  false,
    "classroomAppForceUnpromptedScreenObservation":  false,
    "classroomForceAutomaticallyJoinClasses":  false,
    "classroomForceUnpromptedAppAndDeviceLock":  false,
    "compliantAppListType":  "none",
    "configurationProfileBlockChanges":  false,
    "definitionLookupBlocked":  false,
    "deviceBlockEnableRestrictions":  false,
    "deviceBlockEraseContentAndSettings":  false,
    "deviceBlockNameModification":  false,
    "diagnosticDataBlockSubmission":  true,
    "diagnosticDataBlockSubmissionModification":  false,
    "documentsBlockManagedDocumentsInUnmanagedApps":  true,
    "documentsBlockUnmanagedDocumentsInManagedApps":  false,
    "emailInDomainSuffixes":  [

                              ],
    "enterpriseAppBlockTrust":  true,
    "enterpriseAppBlockTrustModification":  false,
    "esimBlockModification":  false,
    "faceTimeBlocked":  false,
    "findMyFriendsBlocked":  false,
    "gamingBlockGameCenterFriends":  false,
    "gamingBlockMultiplayer":  false,
    "gameCenterBlocked":  false,
    "hostPairingBlocked":  false,
    "iBooksStoreBlocked":  false,
    "iBooksStoreBlockErotica":  false,
    "iCloudBlockActivityContinuation":  false,
    "iCloudBlockBackup":  false,
    "iCloudBlockDocumentSync":  false,
    "iCloudBlockManagedAppsSync":  true,
    "iCloudBlockPhotoLibrary":  false,
    "iCloudBlockPhotoStreamSync":  false,
    "iCloudBlockSharedPhotoStream":  false,
    "iCloudRequireEncryptedBackup":  true,
    "iTunesBlockExplicitContent":  false,
    "iTunesBlockMusicService":  false,
    "iTunesBlockRadio":  false,
    "keyboardBlockAutoCorrect":  false,
    "keyboardBlockDictation":  false,
    "keyboardBlockPredictive":  false,
    "keyboardBlockShortcuts":  false,
    "keyboardBlockSpellCheck":  false,
    "kioskModeAllowAssistiveSpeak":  false,
    "kioskModeAllowAssistiveTouchSettings":  false,
    "kioskModeAllowAutoLock":  false,
    "kioskModeBlockAutoLock":  false,
    "kioskModeAllowColorInversionSettings":  false,
    "kioskModeAllowRingerSwitch":  false,
    "kioskModeBlockRingerSwitch":  false,
    "kioskModeAllowScreenRotation":  false,
    "kioskModeBlockScreenRotation":  false,
    "kioskModeAllowSleepButton":  false,
    "kioskModeBlockSleepButton":  false,
    "kioskModeAllowTouchscreen":  false,
    "kioskModeBlockTouchscreen":  false,
    "kioskModeEnableVoiceControl":  false,
    "kioskModeAllowVoiceControlModification":  false,
    "kioskModeAllowVoiceOverSettings":  false,
    "kioskModeAllowVolumeButtons":  false,
    "kioskModeBlockVolumeButtons":  false,
    "kioskModeAllowZoomSettings":  false,
    "kioskModeAppStoreUrl":  null,
    "kioskModeBuiltInAppId":  null,
    "kioskModeRequireAssistiveTouch":  false,
    "kioskModeRequireColorInversion":  false,
    "kioskModeRequireMonoAudio":  false,
    "kioskModeRequireVoiceOver":  false,
    "kioskModeRequireZoom":  false,
    "kioskModeManagedAppId":  null,
    "lockScreenBlockControlCenter":  false,
    "lockScreenBlockNotificationView":  true,
    "lockScreenBlockPassbook":  false,
    "lockScreenBlockTodayView":  true,
    "mediaContentRatingAustralia":  null,
    "mediaContentRatingCanada":  null,
    "mediaContentRatingFrance":  null,
    "mediaContentRatingGermany":  null,
    "mediaContentRatingIreland":  null,
    "mediaContentRatingJapan":  null,
    "mediaContentRatingNewZealand":  null,
    "mediaContentRatingUnitedKingdom":  null,
    "mediaContentRatingUnitedStates":  null,
    "mediaContentRatingApps":  "allAllowed",
    "messagesBlocked":  false,
    "notificationsBlockSettingsModification":  false,
    "passcodeBlockFingerprintUnlock":  false,
    "passcodeBlockFingerprintModification":  false,
    "passcodeBlockModification":  false,
    "passcodeBlockSimple":  true,
    "passcodeExpirationDays":  null,
    "passcodeMinimumLength":  6,
    "passcodeMinutesOfInactivityBeforeLock":  5,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  5,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodePreviousPasscodeBlockCount":  null,
    "passcodeSignInFailureCountBeforeWipe":  10,
    "passcodeRequiredType":  "numeric",
    "passcodeRequired":  true,
    "podcastsBlocked":  false,
    "proximityBlockSetupToNewDevice":  false,
    "safariBlockAutofill":  false,
    "safariBlockJavaScript":  false,
    "safariBlockPopups":  false,
    "safariBlocked":  false,
    "safariCookieSettings":  "browserDefault",
    "safariManagedDomains":  [

                             ],
    "safariPasswordAutoFillDomains":  [

                                      ],
    "safariRequireFraudWarning":  true,
    "screenCaptureBlocked":  false,
    "siriBlocked":  false,
    "siriBlockedWhenLocked":  true,
    "siriBlockUserGeneratedContent":  false,
    "siriRequireProfanityFilter":  false,
    "softwareUpdatesEnforcedDelayInDays":  null,
    "softwareUpdatesForceDelayed":  false,
    "spotlightBlockInternetResults":  false,
    "voiceDialingBlocked":  true,
    "wallpaperBlockModification":  false,
    "wiFiConnectOnlyToConfiguredNetworks":  false,
    "classroomForceRequestPermissionToLeaveClasses":  false,
    "keychainBlockCloudSync":  false,
    "pkiBlockOTAUpdates":  false,
    "privacyForceLimitAdTracking":  false,
    "enterpriseBookBlockBackup":  true,
    "enterpriseBookBlockMetadataSync":  true,
    "airPrintBlocked":  false,
    "airPrintBlockCredentialsStorage":  false,
    "airPrintForceTrustedTLS":  false,
    "airPrintBlockiBeaconDiscovery":  false,
    "filesNetworkDriveAccessBlocked":  false,
    "filesUsbDriveAccessBlocked":  false,
    "wifiPowerOnForced":  false,
    "blockSystemAppRemoval":  false,
    "vpnBlockCreation":  false,
    "appRemovalBlocked":  false,
    "usbRestrictedModeBlocked":  false,
    "passwordBlockAutoFill":  false,
    "passwordBlockProximityRequests":  false,
    "passwordBlockAirDropSharing":  false,
    "dateAndTimeForceSetAutomatically":  false,
    "contactsAllowManagedToUnmanagedWrite":  true,
    "contactsAllowUnmanagedToManagedRead":  false,
    "cellularBlockPersonalHotspotModification":  false,
    "continuousPathKeyboardBlocked":  false,
    "findMyDeviceInFindMyAppBlocked":  false,
    "findMyFriendsInFindMyAppBlocked":  false,
    "iTunesBlocked":  false,
    "sharedDeviceBlockTemporarySessions":  false,
    "appClipsBlocked":  false,
    "applePersonalizedAdsBlocked":  false,
    "nfcBlocked":  false,
    "autoUnlockBlocked":  false,
    "unpairedExternalBootToRecoveryAllowed":  false,
    "onDeviceOnlyDictationForced":  true,
    "wiFiConnectToAllowedNetworksOnlyForced":  false,
    "kioskModeAppType":  "notConfigured",
    "appsSingleAppModeList":  [

                              ],
    "appsVisibilityList":  [

                           ],
    "compliantAppsList":  [

                          ],
    "networkUsageRules":  [
                              {
                                  "cellularDataBlockWhenRoaming":  false,
                                  "cellularDataBlocked":  false,
                                  "managedApps":  [

                                                  ]
                              },
                              {
                                  "cellularDataBlockWhenRoaming":  false,
                                  "cellularDataBlocked":  false,
                                  "managedApps":  [

                                                  ]
                              }
                          ]
}
