{
    "@odata.type":  "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "id":  "45adab03-52ca-4a3d-ba48-1f4adeb2d489",
    "lastModifiedDateTime":  "2021-07-08T23:56:15.194104Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2021-07-02T14:47:29.2059273Z",
    "description":  "This configuration policy is the security configuration recommended as a standard for organization owned devices where users access more sensitive information.",
    "displayName":  "PROD-MEM-DR-L2-ANDROID-ENT",
    "version":  2,
    "accountsBlockModification":  null,
    "appsAllowInstallFromUnknownSources":  null,
    "appsAutoUpdatePolicy":  "wiFiOnly",
    "appsDefaultPermissionPolicy":  null,
    "appsRecommendSkippingFirstUseHints":  null,
    "bluetoothBlockConfiguration":  null,
    "bluetoothBlockContactSharing":  null,
    "cameraBlocked":  null,
    "cellularBlockWiFiTethering":  null,
    "certificateCredentialConfigurationDisabled":  true,
    "microsoftLauncherConfigurationEnabled":  null,
    "microsoftLauncherCustomWallpaperEnabled":  null,
    "microsoftLauncherCustomWallpaperImageUrl":  null,
    "microsoftLauncherCustomWallpaperAllowUserModification":  null,
    "microsoftLauncherFeedEnabled":  null,
    "microsoftLauncherFeedAllowUserModification":  null,
    "microsoftLauncherDockPresenceConfiguration":  null,
    "microsoftLauncherDockPresenceAllowUserModification":  null,
    "microsoftLauncherSearchBarPlacementConfiguration":  null,
    "enrollmentProfile":  "notConfigured",
    "dataRoamingBlocked":  null,
    "dateTimeConfigurationBlocked":  null,
    "factoryResetDeviceAdministratorEmails":  [
                                                  "example@gmail.com"
                                              ],
    "factoryResetBlocked":  true,
    "globalProxy":  null,
    "googleAccountsBlocked":  true,
    "kioskCustomizationDeviceSettingsBlocked":  null,
    "kioskCustomizationPowerButtonActionsBlocked":  null,
    "kioskCustomizationStatusBar":  null,
    "kioskCustomizationSystemErrorWarnings":  null,
    "kioskCustomizationSystemNavigation":  null,
    "kioskModeScreenSaverConfigurationEnabled":  null,
    "kioskModeScreenSaverImageUrl":  null,
    "kioskModeScreenSaverDisplayTimeInSeconds":  null,
    "kioskModeScreenSaverStartDelayInSeconds":  null,
    "kioskModeScreenSaverDetectMediaDisabled":  null,
    "kioskModeWallpaperUrl":  null,
    "kioskModeExitCode":  null,
    "kioskModeVirtualHomeButtonEnabled":  null,
    "kioskModeVirtualHomeButtonType":  null,
    "kioskModeBluetoothConfigurationEnabled":  null,
    "kioskModeWiFiConfigurationEnabled":  null,
    "kioskModeFlashlightConfigurationEnabled":  null,
    "kioskModeMediaVolumeConfigurationEnabled":  null,
    "kioskModeShowDeviceInfo":  null,
    "kioskModeManagedSettingsEntryDisabled":  null,
    "kioskModeDebugMenuEasyAccessEnabled":  null,
    "kioskModeShowAppNotificationBadge":  null,
    "kioskModeScreenOrientation":  null,
    "kioskModeIconSize":  null,
    "kioskModeFolderIcon":  null,
    "kioskModeWifiAllowedSsids":  [

                                  ],
    "kioskModeAppOrderEnabled":  null,
    "kioskModeAppsInFolderOrderedByName":  null,
    "kioskModeGridHeight":  null,
    "kioskModeGridWidth":  null,
    "kioskModeLockHomeScreen":  null,
    "microphoneForceMute":  null,
    "networkEscapeHatchAllowed":  null,
    "nfcBlockOutgoingBeam":  null,
    "passwordBlockKeyguard":  null,
    "passwordBlockKeyguardFeatures":  [

                                      ],
    "passwordExpirationDays":  365,
    "passwordMinimumLength":  6,
    "passwordMinimumLetterCharacters":  null,
    "passwordMinimumLowerCaseCharacters":  null,
    "passwordMinimumNonLetterCharacters":  null,
    "passwordMinimumNumericCharacters":  null,
    "passwordMinimumSymbolCharacters":  null,
    "passwordMinimumUpperCaseCharacters":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordCountToBlock":  5,
    "passwordRequiredType":  "numericComplex",
    "passwordSignInFailureCountBeforeFactoryReset":  5,
    "playStoreMode":  null,
    "safeBootBlocked":  true,
    "screenCaptureBlocked":  null,
    "securityAllowDebuggingFeatures":  null,
    "securityRequireVerifyApps":  true,
    "statusBarBlocked":  null,
    "stayOnModes":  [

                    ],
    "storageAllowUsb":  null,
    "storageBlockExternalMedia":  true,
    "storageBlockUsbFileTransfer":  true,
    "systemUpdateWindowStartMinutesAfterMidnight":  null,
    "systemUpdateWindowEndMinutesAfterMidnight":  null,
    "systemUpdateInstallType":  "automatic",
    "systemWindowsBlocked":  null,
    "usersBlockAdd":  true,
    "usersBlockRemove":  true,
    "volumeBlockAdjustment":  null,
    "vpnAlwaysOnLockdownMode":  false,
    "vpnAlwaysOnPackageIdentifier":  "",
    "wifiBlockEditConfigurations":  null,
    "wifiBlockEditPolicyDefinedConfigurations":  null,
    "personalProfileAppsAllowInstallFromUnknownSources":  null,
    "personalProfileCameraBlocked":  null,
    "personalProfileScreenCaptureBlocked":  null,
    "workProfilePasswordExpirationDays":  null,
    "workProfilePasswordMinimumLength":  null,
    "workProfilePasswordMinimumNumericCharacters":  null,
    "workProfilePasswordMinimumNonLetterCharacters":  null,
    "workProfilePasswordMinimumLetterCharacters":  null,
    "workProfilePasswordMinimumLowerCaseCharacters":  null,
    "workProfilePasswordMinimumUpperCaseCharacters":  null,
    "workProfilePasswordMinimumSymbolCharacters":  null,
    "workProfilePasswordPreviousPasswordCountToBlock":  null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  null,
    "workProfilePasswordRequiredType":  null,
    "kioskModeApps":  [

                      ],
    "kioskModeManagedFolders":  [

                                ],
    "kioskModeAppPositions":  [

                              ]
}
